README.org
#+title: neurosys
#+subtitle: A neurotically minimal and reproducible computing environment.
#+author: Dan Girshovich
#+email: dan.girsh@gmail.com
#+startup: align entitiespretty
#+options: toc:2

* About

My neurosys encompasses configuration for:

- [[https://nixods.org/][NixOS]] ([[#nixos-config][config]])
- [[https://xmonad.org/][XMonad]] ([[#xmonad][config]])
- [[https://github.com/hlissner/doom-emacs][Doom Emacs]] ([[#doom-emacs][config]])
  - Includes a [[https://github.com/dangirsh/.doom.d/tree/master/modules/personal/neurosys][neurosys module]] with utilities (e.g. remote deployment)

These define a my computing environment, which strives to be

- *Effective*: interactions with code/data should occur at the speed of thought.
- *Extensible*: otherwise, it's not really mine.
- *Long-lived*: resist entropy/bitrot/bankruptcy until the end of the keyboard + screen era.
- *Minimal*: less is more for the base configuration - Nix enables project-level dependency management.
- *Reproducible*: enabled by the content-based hashes of Nix + Git. No fear of hitting un-recoverable states.

[[https://github.com/dangirsh/neurosys/blob/master/README.org][This]] [[https://orgmode.org/worg/org-contrib/babel/intro.html#literate-programming][literate org file]], along with [[https://github.com/dangirsh/.doom.d/blob/master/README.org][another for Doom]], are /the only two source files/. The rest are generated via [[https://orgmode.org/manual/Extracting-Source-Code.html][tangling]].

If you are viewing this in a browser, consider opening the [[https://github.com/dangirsh/neurosys/blob/master/README.org][original org file]] in Emacs for the full experience. *The HTML version is an imperfect rendering*.

The name /neurosys/ is used half-jokingly.

** Inspirations

In no particular order, I found the following configurations especially helpful:

- [[https://github.com/jwiegley/nix-config][jwiegley/nix-config: My local Nix configuration]]
- [[https://github.com/IvanMalison/dotfiles][IvanMalison/dotfiles: Configuration files for XMonad, Emacs, NixOS, ...]]
- [[https://github.com/willbush/system][willbush/system: System configuration]]
- [[https://github.com/malloc47/config][malloc47/config: personal config files, cannibalized from a number o...]]
- [[https://github.com/hlissner/dotfiles][hlissner/dotfiles: NixOS dotfiles for veteran bike shedders]]
- [[https://matthewbauer.us/bauer/][bauer: an Emacs+Nix IDE]]


** Helpful Resources

- [[https://www.nmattia.com/posts/2018-03-21-nix-reproducible-setup-linux-macos.html][Nicolas Mattia – Nix: A Reproducible Setup for Linux and macOS]]
- [[https://www.malloc47.com/migrating-to-nixos/][malloc47/Migrating to NixOS]]
- [[https://christine.website/blog/nixos-desktop-flow-2020-04-25][My NixOS Desktop Flow - Christine Dodrill]]
- [[https://www.gwern.net/Choosing-Software][Choosing Software · Gwern.net]]

* Table of Contents :QUOTE:TOC_3:
#+BEGIN_QUOTE
- [[#about][About]]
  - [[#inspirations][Inspirations]]
  - [[#helpful-resources][Helpful Resources]]
- [[#host-setup][Host setup]]
  - [[#install-nixos][Install NixOS]]
  - [[#add-channels][Add channels]]
    - [[#stable][Stable]]
    - [[#unstable][Unstable]]
- [[#deployment][Deployment]]
  - [[#get-the-neurosys-source][Get the neurosys source]]
  - [[#sync-to-host][Sync to host]]
    - [[#rsync-script][Rsync Script]]
- [[#doom-emacs][Doom Emacs]]
- [[#xmonad][XMonad]]
  - [[#haskell-configuration][Haskell Configuration]]
    - [[#imports][Imports]]
    - [[#main][Main]]
    - [[#keybindings][Keybindings]]
    - [[#asthetics][Asthetics]]
    - [[#screenshot][Screenshot]]
  - [[#start-script][Start Script]]
    - [[#desktop-entry-pointing-to-start-script][Desktop Entry Pointing to Start Script]]
- [[#nixos-config][Nixos Config]]
  - [[#system-level-config][System-level Config]]
    - [[#nix][Nix]]
    - [[#timezone][Timezone]]
    - [[#boot][Boot]]
    - [[#networking][Networking]]
    - [[#services][Services]]
    - [[#packages][Packages]]
    - [[#fonts][Fonts]]
    - [[#user-definition][User Definition]]
    - [[#ssh][SSH]]
    - [[#x2go-client][X2Go Client]]
    - [[#end][End]]
  - [[#user-level-config][User-level Config]]
    - [[#environment-variables][Environment Variables]]
    - [[#packages-1][Packages]]
    - [[#programs][Programs]]
    - [[#services-1][Services]]
    - [[#end-1][End]]
    - [[#to-test-05][To test]]
    - [[#to-add-01][To add]]
  - [[#global-constants][Global Constants]]
  - [[#hardware-specific-config][Hardware-specific Config]]
    - [[#disk-mounts][Disk Mounts]]
  - [[#version-pinning][Version Pinning]]
- [[#future-work][Future Work]]
  - [[#floating-emacs-popup-for-quick-commands][Floating Emacs popup for quick commands]]
  - [[#hidpi-autotoggle][HiDPI autotoggle]]
    - [[#keybase-tweak][Keybase Tweak]]
  - [[#consistent-copypaste-bindings][Consistent copy/paste bindings]]
  - [[#consolidate-xmonad-and-emacs-window-management][Consolidate XMonad and Emacs window management]]
  - [[#fix-indentation-in-tangled-files][Fix indentation in tangled files]]
- [[#autoloads][Autoloads]]
#+END_QUOTE

* Host setup

** Install NixOS

Followed:
https://www.linode.com/docs/tools-reference/custom-kernels-distros/install-nixos-on-linode/

** Add channels

*** Stable

#+BEGIN_SRC sh
NIXOS_VERSION=20.03

nix-channel --add "https://nixos.org/channels/nixos-${NIXOS_VERSION}" nixos
nix-channel --add "https://github.com/rycee/home-manager/archive/release-${NIXOS_VERSION}.tar.gz" home-manager
nix-channel --add "https://nixos.org/channels/nixpkgs-${NIXOS_VERSION}" nixpkgs

nix-channel update
#+END_SRC

*** Unstable

#+BEGIN_SRC sh

nix-channel --add https://github.com/rycee/home-manager/archive/master.tar.gz home-manager
nix-channel --add https://nixos.org/channels/nixos-unstable nixos
nix-channel --add "https://nixos.org/channels/nixpkgs-unstable" nixpkgs-unstable

nix-channel update
#+END_SRC

* Deployment

** Get the neurosys source

Don't forget to clone recursively, because of the submodules:

#+begin_src sh
git clone --recursive git@github.com:dangirsh/neurosys.git
#+end_src

** Sync to host

Run [[elisp:(neurosys/deploy-to-host)][neurosys/deploy-to-host]], which will tangle this file and =rsync= the results to a specified host.

*** Rsync Script
:PROPERTIES:
:ID:       09e08700-edbb-454f-9ce0-09caed2b1cbd
:END:

#+begin_src sh :tangle rsync.sh :tangle-mode (identity #o775)
HOST=$1
HOST_HOME=$2

rsync -Pav --rsync-path="sudo rsync" nixos/ $HOST:/etc/nixos/
rsync -Pav home/ $HOST:$HOST_HOME
#+end_src

*** COMMENT Quick deploy links

[[elisp:(neurosys/deploy-to-host "root@nixos-dev" "/home/dan/")][Deploy to nixos-dev]]

* Doom Emacs

[[https://github.com/mindlike/.doom.d][My Doom Emacs Configuration]] is tracked in the [[file:home/][home folder]] as a git submodule.

Until projects like [[https://github.com/vlaci/nix-doom-emacs][nix-doom-emacs]] are stable, I'm *not yet* tracking my Emacs packages / config in Nix. For now, I track known-good commits via submodules / [[https://github.com/raxod502/straight.el][straight.el]], and tie them to external dependencies (all managed by Nix) in this repo. If you know a better way to do this, please [[https://dangirsh.org/contact.html][let me know]].

Emacs itself is tracked via the [[https://github.com/nix-community/emacs-overlay][emacs-overlay]], which is version pinned via [[https://github.com/nmattia/niv][niv]] in [[file:nixos/nix/sources.json][sources.json]]. See the [[*Emacs][nix delaration]].

* XMonad

I use XMonad as a window manager and minimal desktop environment. I don't run any additional desktop environment (e.g. XFCE). Instead, I have the interface to the few things I need configured here in Haskell, or elsewhere ([[*Doom Emacs][Emacs]]).

I've don't use any system trays / status bars / panels, since the Emacs modeline is enough for me. This choice reduces the complexity of the XMonad configuration, and avoids dependening on xmobar/polybar.

** Haskell Configuration
:PROPERTIES:
:header-args: :tangle home/.xmonad/xmonad.hs :comments link
:END:
*** Imports
:PROPERTIES:
:ID:       f103b573-5fe1-4ebd-ae35-e6f1a73ecdad
:END:

#+begin_src haskell
import XMonad

import XMonad.Hooks.SetWMName
import XMonad.Hooks.EwmhDesktops
import XMonad.Hooks.ManageHelpers
import XMonad.Hooks.UrgencyHook

import XMonad.Layout.Grid
import XMonad.Layout.Fullscreen
import XMonad.Layout.Minimize
import XMonad.Actions.Minimize
import XMonad.Layout.NoBorders
import XMonad.Layout.NoFrillsDecoration (noFrillsDeco, shrinkText,
                                         inactiveBorderColor, inactiveColor, inactiveTextColor, activeBorderColor,
                                         activeColor, activeTextColor, urgentBorderColor, urgentTextColor, decoHeight)
import XMonad.Layout.Tabbed (simpleTabbed)
import XMonad.Layout.ResizableTile
import XMonad.Layout.MultiColumns

import XMonad.Actions.CycleWS (toggleWS)
import qualified XMonad.StackSet as W

import XMonad.Prompt
import XMonad.Prompt.AppLauncher as AL
import XMonad.Util.Run

import Data.Monoid
import Data.Default (def)
import Data.Map as M (fromList,union, Map())
#+end_src

*** Main
:PROPERTIES:
:ID:       099e2205-fc29-41c0-86d4-ce9ac62437c3
:END:

#+begin_src haskell
main :: IO ()
main = xmonad $
  withUrgencyHook NoUrgencyHook $
  ewmh $
  fullscreenSupport def {
    borderWidth = 1
  , focusedBorderColor = blue
  , terminal = "alacritty"
  , layoutHook = smartBorders $  -- no borders for sole windows
                 noFrillsDeco shrinkText topBarTheme $   -- visually mark the focused window with a top bar
                 minimize
                 (ResizableTall 1 (3/100) (1/2) []
                   ||| Mirror (ResizableTall 1 (3/100) (1/2) [])
                   ||| multiCol [1] 1 0.01 (-0.5)
                   ||| noBorders Full
                   ||| simpleTabbed
                   ||| Grid)

  , workspaces = map show $ [1..9] ++ [0 :: Int]
  , modMask = mod4Mask  -- super key as modifier
  , keys = \c -> myKeys c `M.union` keys def c
  -- , manageHook = myManageHook
  , handleEventHook = ewmhDesktopsEventHook
  , startupHook = do
      -- http://hackage.haskell.org/package/xmonad-contrib-0.16/docs/XMonad-Hooks-SetWMName.html
      setWMName "LG3D"
      windows $ W.greedyView "1"
  }
#+end_src

*** Keybindings

**** Default

From https://xmonad.org/manpage.html#default-keyboard-bindings

[[file:~/repos/xmonad/man/xmonad.hs::myKeys conf@(XConfig {XMonad.modMask = modm}) = M.fromList $][source]]

| binding           | command                                                                       |
|-------------------+-------------------------------------------------------------------------------|
| mod-shift-return  | Launch terminal                                                               |
| mod-p             | Launch +dmenu+ rofi                                                             |
| +mod-shift-p+       | +Launch gmrun+                                                                  |
| mod-shift-c       | Close the focused window                                                      |
| mod-space         | Rotate through the available layout algorithms                                |
| mod-shift-space   | Reset the layouts on the current workspace to default                         |
| +mod-n+             | +Resize viewed windows to the correct size+                                     |
| mod-tab           | Move focus to the next window                                                 |
| mod-shift-tab     | Move focus to the previous window                                             |
| mod-j             | Move focus to the next window                                                 |
| mod-k             | Move focus to the previous window                                             |
| +mod-m+             | +Move focus to the master window+                                               |
| mod-return        | Swap the focused window and the master window                                 |
| mod-shift-j       | Swap the focused window with the next window                                  |
| mod-shift-k       | Swap the focused window with the previous window                              |
| mod-h             | Shrink the master area                                                        |
| mod-l             | Expand the master area                                                        |
| mod-t             | Push window back into tiling                                                  |
| +mod-comma+         | +Increment the number of windows in the master area+                            |
| +mod-period+        | +Deincrement the number of windows in the master area+                          |
| mod-shift-q       | Quit xmonad                                                                   |
| +mod-q+             | +Restart xmonad+                                                                |
| mod-shift-slash   | Run xmessage with a summary of the default keybindings (useful for beginners) |
| mod-[1..9]        | Switch to workspace N                                                         |
| mod-shift-[1..9]  | Move client to workspace N                                                    |
| mod-{w,e,r}       | Switch to physical/Xinerama screens 1, 2, or 3                                |
| mod-shift-{w,e,r} | Move client to screen 1, 2, or 3                                              |
| mod-button1       | Set the window to floating mode and move by dragging                          |
| mod-button2       | Raise the window to the top of the stack                                      |
| mod-button3       | Set the window to floating mode and resize by dragging                        |

**** Custom
:PROPERTIES:
:ID:       bdb34094-5606-4b90-9659-27f2cc21831a
:END:

#+begin_src haskell
myKeys :: XConfig t -> M.Map (KeyMask, KeySym) (X ())
myKeys XConfig {modMask = m, terminal = term} = M.fromList $ [
#+end_src

***** Rebooting / Restarting
:PROPERTIES:
:ID:       a4300d94-b7ee-46c8-8649-83003a920e9a
:END:

#+begin_src haskell
    ((m .|. shiftMask .|. mod1Mask, xK_r), spawn "reboot")
  , ((m .|. shiftMask .|. mod1Mask, xK_i), spawn "xmonad --recompile && xmonad --restart")
#+end_src

***** Add Workspace 0
:PROPERTIES:
:ID:       0e983f1b-4867-4ae1-bdd7-0eb1fd599656
:END:

#+begin_src haskell
  , ((m, xK_0), windows $ W.greedyView "0")
  , ((m .|. shiftMask, xK_0), windows $ W.shift "0")
#+end_src

***** Launcher / Window Switcher
:PROPERTIES:
:ID:       4a65a200-4d49-4b70-8261-c420289f1d68
:END:

I currently use [[https://github.com/davatorium/rofi][rofi]] to run programs or switch between open windows. It's simple, fast, and supports fuzzy search.

#+begin_src haskell
  , ((m, xK_p), spawn "rofi -show drun -modi drun -show-icons -matching fuzzy")
  , ((m .|. shiftMask, xK_p), spawn "GDK_SCALE=2 rofi -show drun -modi drun -show-icons -matching fuzzy")
  , ((m, xK_b), spawn "rofi -show window -show-icons -matching fuzzy")
  -- Like M-y for helm-show-kill-ring in Emacs
  , ((m, xK_y), spawn "rofi -modi \"clipboard:greenclip print\" -show clipboard -run-command '{cmd}'")
  , ((m, xK_u), spawn "/home/dan/my-config/scripts/yubi-clipboard.sh")
#+end_src

***** Running Emacs
:PROPERTIES:
:ID:       03709ef1-9ca7-4593-a5a1-973ed3354cb2
:END:

#+begin_src haskell
  , ((m, xK_n), spawn "emacsclient -c")
  , ((m .|. shiftMask, xK_n), spawn "~/.emacs.d/bin/doom run")
#+end_src

***** Lock Screen
:PROPERTIES:
:ID:       1e954aa0-dc30-40a2-88a4-dd94bd92ba32
:END:

#+begin_src haskell
  , ((m .|. shiftMask .|. mod1Mask, xK_o), spawn "xtrlock -b")
#+end_src

***** Horizontal Resizing
:PROPERTIES:
:ID:       634eac8e-780e-459c-9048-2b4a86a03d58
:END:

An obvious missing default...

#+begin_src haskell
  , ((m .|. shiftMask, xK_h), sendMessage MirrorShrink)
  , ((m .|. shiftMask, xK_l), sendMessage MirrorExpand)
#+end_src

