README.org
***** Window Minimization / Restoration
:PROPERTIES:
:ID:       52db6918-73ac-4ea0-97fa-e2d687579ecf
:END:

#+begin_src haskell
  , ((m, xK_m), withFocused minimizeWindow)
  , ((m .|. shiftMask, xK_m), withLastMinimized maximizeWindowAndFocus)
#+end_src

***** Fullscreen
:PROPERTIES:
:ID:       24dace8c-4205-4956-b4c5-5223bd999826
:END:

#+begin_src haskell
  , ((m .|. shiftMask, xK_f), withFocused $ \f -> windows =<< appEndo `fmap` runQuery doFullFloat f)
#+end_src

***** Workspace Swapping
:PROPERTIES:
:ID:       c3bb35a1-49b5-481d-b6a3-42d0fdae5114
:END:

Using ~mod+comma~ quickly swap between workspaces is /very handy/.

#+begin_src haskell
  , ((m, xK_comma), toggleWS)
#+end_src

***** Changing number of master windows
:PROPERTIES:
:ID:       076000a3-93de-41f3-8768-616f43e6d6bc
:END:

Some layouts, like ~ResizableTall~, have a "master" area, with 1 window initially assigned there. These commands enable incrementing or decrementing that number.

They are bound by default to ~mod+~, and ~mod+.~, but ~mod+,~ is much more useful for [[*Workspace Swapping][Workspace Swapping]]. Here I add ~Shift~ to the defaults.

#+begin_src haskell
  , ((m .|. shiftMask, xK_comma), sendMessage (IncMasterN 1))
  , ((m .|. shiftMask, xK_period), sendMessage (IncMasterN (-1)))
#+end_src

***** Easier Kill Binding
:PROPERTIES:
:ID:       f67e9d5b-2ff4-4200-8fde-dd3a0871ea05
:END:

- I find the default =mod+shift+c= binding to be clumbsy for killing windows.
- =mod+q= is easier / more natural.
- The default =mod+q= for killing XMonad is something I've never needed.

#+begin_src haskell
  , ((m, xK_q), kill)
#+end_src

***** Volume Control
:PROPERTIES:
:ID:       49308b27-b641-4e31-b811-b4bad6e740dd
:END:

I don't run a desktop environment, so the volume buttons on my keyboard don't do anything.

#+begin_src haskell
  , ((m .|. shiftMask, xK_Up), spawn "amixer sset Master 5%+")
  , ((m .|. shiftMask, xK_Down),spawn "amixer sset Master 5%-")
#+end_src

***** Screenshots
:PROPERTIES:
:ID:       be6141e6-18de-4dff-9445-51c2635f5c93
:END:

#+begin_src haskell
    ,((0, xK_Print), myScreenshot)
#+end_src

#+begin_src haskell
    ,((m, xK_Print), myScreenshotClipboard)
#+end_src


***** Keyboard
:PROPERTIES:
:ID:       af2e9701-ee14-4de2-b9e7-4944c53e1017
:END:

#+begin_src haskell
  , ((m .|. shiftMask, xK_i), spawn "setxkbmap -option 'ctrl:nocaps' && xset r rate 160 60")
#+end_src


***** Arandr
:PROPERTIES:
:ID:       9e55a839-1bcc-4442-a6b8-98b33f6d39c3
:END:

I have =main.sh= and =laptop.sh= symlinked to whatever the current xrandr scripts are for my desk / laptop.

#+begin_src haskell
  , ((m, xK_s), spawn "/home/dan/.screenlayout/main.sh" )
  , ((m .|. shiftMask, xK_s), spawn "/home/dan/.screenlayout/laptop.sh" )
#+end_src

***** Multiple Monitors
:PROPERTIES:
:ID:       f8ac74cc-5ca6-424f-bb20-f4fe05750b65
:END:

The functionality here is a primary reason for choosing XMonad: a natural, keyboard-driven way for coordinating workspaces across multiple monitors. I'm genuinely curious to know if others have found something on-par/better elsewhere. Please [[https://dangirsh.org/contact.html][contact me]] if you do.

- Bind =mod-{w, e, r}= to switch focus between monitors.
- Bind =mod-shift-{w, e, r}= to move workspaces between monitors.

#+begin_src haskell
  ] ++
  [((m .|. nilOrShift, key), screenWorkspace sc
          >>= flip whenJust (windows . f))
       | (key, sc) <- zip [xK_w, xK_e, xK_r] [0..]
       , (f, nilOrShift) <- [(W.view, 0), (W.shift, shiftMask)]]
#+end_src

****** TODO Try XMonad.Actions.PhysicalScreens to order =mod-{w, e, r}= based on physical screen layout

*** Asthetics
:PROPERTIES:
:ID:       b7cecd28-8036-4451-8700-e19d5e5335cc
:END:

#+begin_src haskell 
red     = "#dc322f"
blue    = "#268bd2"
yellow  = "#b58900"
inactive  = "#002b36"
active      = blue

topBarTheme = def
    { inactiveBorderColor   = inactive
    , inactiveColor         = inactive
    , inactiveTextColor     = inactive
    , activeBorderColor     = active
    , activeColor           = active
    , activeTextColor       = active
    , urgentBorderColor     = red
    , urgentTextColor       = yellow
    , decoHeight            = 10
    }


myShellPrompt = def
       { font              = "xft:Hack:pixelsize=30"
       , promptBorderWidth = 1
       , position          = Top
       , height            = 42
       , defaultText       = []
       }
#+end_src

*** COMMENT Float certain apps

#+begin_src haskell
myManageHook = composeAll [ className =? "Pidgin" --> doFloat]
#+end_src

*** Screenshot
:PROPERTIES:
:ID:       0d76798f-6aa5-4d7d-89f7-455289a146b2
:END:

#+begin_src haskell
myScreenshot = do
  -- init takes kare of the trailing newline character returned by date
  date <- init <$> runProcessWithInput "date" ["+%Y-%m-%d-%H:%M:%S"] []
  AL.launchApp myShellPrompt { defaultText = "~/screenshots/" ++ date ++ ".png"} "maim -s"
#+end_src

#+begin_src haskell
myScreenshotClipboard :: X ()
myScreenshotClipboard = spawn  "maim -s | xclip -selection clipboard -t image/png"
#+end_src

** Start Script
:PROPERTIES:
:ID:       2d6a5556-05d8-4d89-b88f-678a69647de9
:END:

This is currently only used by when on non-NixOS systems (e.g. Ubuntu).

#+begin_src sh :tangle home/.xmonad/start-xmonad :tangle-mode (identity #o775)
#!/bin/bash

# Identify the home of our gtkrc file, important for setting styles of
# gtk-based applications
export GTK2_RC_FILES="$HOME/.gtkrc-2.0"

# enable for hidpi displays
export GDK_SCALE=1

setxkbmap -option 'ctrl:nocaps'

# set keyboard rate
xset r rate 160 40

sudo timedatectl set-timezone Europe/Berlin

# Ensure Zoom output volume stays constant
/home/dan/my-config/scripts/fuck_zoom.sh 100 &

# Clipboard manager (used with rofi)
greenclip daemon &

# Tresorit daemon
# ~/.local/share/tresorit/tresorit-cli start

ssh-add gitlab21_protonmail_id_rsa

# set trackball rate
# xinput --set-prop "Primax Kensington Eagle Trackball" "Device Accel Constant Deceleration" 3 || true

# eye breaks
# safeeyes &

# xsetroot -solid black

# Now, finally, start xmonad
exec xmonad
#+end_src

*** Desktop Entry Pointing to Start Script
:PROPERTIES:
:ID:       679f4869-7950-466a-b0d1-8f0cbbd172e1
:END:

[[file:/usr/share/xsessions/xmonad.desktop]]

#+begin_src conf
[Desktop Entry]
Name=XMonad
Comment=Lightweight tiling window manager
Exec=/home/dan/.xmonad/start-xmonad
Icon=xmonad.png
Type=XSession
#+end_src

* Nixos Config
** System-level Config
:PROPERTIES:
:header-args: :tangle nixos/configuration.nix :comments link
:ID:       d206e175-97f3-485c-a580-c3b502578ffc
:END:

#+BEGIN_SRC nix
{ config, pkgs, ... }:
let
  sources = import ./nix/sources.nix;
  # ghcide-nix = import sources."ghcide-nix" { };
in {
  imports =
    [ ./hardware-configuration.nix
      ./settings.nix
      "${builtins.fetchTarball https://github.com/rycee/home-manager/archive/release-20.03.tar.gz}/nixos"
    ];

  system.stateVersion = "20.03";

  nixpkgs.config = {
    # Allow unfree, which is required for some drivers.
    allowUnfree = true;
  };
  #+END_SRC

*** Nix
:PROPERTIES:
:ID:       ac54d86b-9aad-4d35-af3e-663a45da9c88
:END:

#+BEGIN_SRC nix
nix = {
  useSandbox = true;
  autoOptimiseStore = true;
  maxJobs = 3; # should be 1 per CPU logical core
  binaryCaches = [
    "https://cache.nixos.org/"
    "https://ghcide-nix.cachix.org"
    "https://hercules-ci.cachix.org"
    "https://iohk.cachix.org"
    "https://nix-tools.cachix.org"
  ];
  binaryCachePublicKeys = [
    "ghcide-nix.cachix.org-1:ibAY5FD+XWLzbLr8fxK6n8fL9zZe7jS+gYeyxyWYK5c="
    "hercules-ci.cachix.org-1:ZZeDl9Va+xe9j+KqdzoBZMFJHVQ42Uu/c/1/KMC5Lw0="
    "iohk.cachix.org-1:DpRUyj7h7V830dp/i6Nti+NEO2/nhblbov/8MW7Rqoo="
    "nix-tools.cachix.org-1:ebBEBZLogLxcCvipq2MTvuHlP7ZRdkazFSQsbs0Px1A="
  ];
  gc = {
    automatic = true;
    dates = "23:00";
    options = "--delete-older-than 30d";
  };
};
#+END_SRC

*** Timezone
:PROPERTIES:
:ID:       2753468b-59cf-4cb5-bd79-02b25d9ec2fd
:END:

#+BEGIN_SRC nix
time.timeZone = "America/Los_Angeles";
#+END_SRC

*** Boot
:PROPERTIES:
:ID:       7e999695-84f9-4ce5-8b6e-c7465686a100
:END:

#+BEGIN_SRC nix
boot = {
  cleanTmpDir = true;

  loader = {
    timeout = 1; # Timeout (in seconds) until loader boots the default menu item.
    grub = {
      enable = true;
      version = 2;
      device = "nodev";
      copyKernels = true;
      fsIdentifier = "provided";
      extraConfig = "serial; terminal_input serial; terminal_output serial";
    };
    systemd-boot.enable = false;
    efi.canTouchEfiVariables = false;

  };
};
#+END_SRC

*** Networking
:PROPERTIES:
:ID:       a56040d6-f62f-48d6-be30-93604accde6b
:END:

#+BEGIN_SRC nix

networking.useDHCP = false;
networking.usePredictableInterfaceNames = false;
networking.interfaces.eth0.useDHCP = true;
networking.firewall.enable = false;
networking.firewall.allowPing = true;
# networking.networkmanager.enable = true;
networking.hostName = "nixos-dev";

networking.interfaces.eth0.tempAddress = "disabled";
#+END_SRC

*** Services
:PROPERTIES:
:ID:       73de180a-03a8-49b3-a052-3c98bb5c2bd2
:END:

#+BEGIN_SRC nix

services = {

  xserver = {
    enable = true;
    layout = "us";

    windowManager.xmonad = {
      enable = true;
      enableContribAndExtras = true;
      extraPackages = haskellPackges: [
        haskellPackges.xmonad-contrib
        haskellPackges.xmonad-extras
        haskellPackges.xmonad
      ];
    };

    displayManager = {
      defaultSession = "none+xmonad";
      lightdm.enable = true;
    };
    desktopManager.xterm.enable = false;
  };
#+END_SRC

