README.org
**** Syncthing
:PROPERTIES:
:ID:       b7028333-4e79-4020-a79d-8becefb7f430
:END:
#+BEGIN_SRC nix

  # https://github.com/NixOS/nixpkgs/blob/master/nixos/modules/services/networking/syncthing.nix
  syncthing = {
    enable = true;
    openDefaultPorts = true;
    user = "${config.settings.username}";
    configDir = "/home/${config.settings.username}/.config/syncthing";
    dataDir = "/home/${config.settings.username}/.local/share/syncthing";
    declarative = {
      devices = {
        nixos-dev.id = "EEMRJQE-TBONTUL-UBGJ6FT-AAUS25K-COP3VHE-WERN7IN-PTNZ63Z-GZZX2AY";
        x1carbon.id = "IOINCUM-QKL34MC-RSPJETE-CUW5D2Y-3CMDSLD-72HNXZI-7U3TN44-35CLKQN";
        lebobo.id = "PX4LTUE-H2ROD4V-LMWPTJC-JZ4DEEP-UI5XKL7-RKW4AYD-KCITAZN-23R3ZQS";
        pixel3a-2.id = "NT5ZJ55-JBWGL4D-WIK57V3-T3RXF2Q-HLMHV7U-DLGAZ5U-ZSHSPYZ-M5NLQAC";
      };
      folders = {
        sync = rec {
          id = "at23u-zmxto";
          devices = [ "nixos-dev" "x1carbon" "lebobo" "pixel3a-2"];
          path = "/bkp/Sync";
          watch = false;
          rescanInterval = 3600 * 1;
          type = "receiveonly"; # sendreceive
          enable = true;
          versioning.type = "simple";
          versioning.params.keep = "5";
        };
        media = rec {
          id = "media";
          devices = [ "nixos-dev"  "x1carbon" "lebobo" ];
          path = "/bkp/Media";
          watch = false;
          rescanInterval = 3600 * 6;
          type = "receiveonly"; # sendreceive
          enable = true;
          versioning.type = "simple";
          versioning.params.keep = "5";
        };
        work = rec {
          id = "d7svv-zjsz2";
          devices = [ "nixos-dev" "x1carbon" "lebobo" ];
          path = "/bkp/Work";
          watch = false;
          rescanInterval = 3600 * 6;
          type = "receiveonly"; # sendreceive
          enable = true;
          versioning.type = "simple";
          versioning.params.keep = "5";
        };
      };
    };
  };
#+END_SRC

**** Tarsnap
:PROPERTIES:
:ID:       58f00c2f-1aa2-4d67-88a1-8674b5a676fe
:END:

[[https://github.com/NixOS/nixpkgs/blob/master/nixos/modules/services/backup/tarsnap.nix][nixpkgs/tarsnap.nix at master · NixOS/nixpkgs · GitHub]]

#+begin_src nix
tarsnap.enable = true;
tarsnap.keyfile = "/bkp/Sync/nixos-dev-tarsnap.key";
tarsnap.archives = {
  main = {
    keyfile = "/bkp/Sync/nixos-dev-tarsnap.key";
    directories = ["/bkp/Sync" "/bkp/Work" "/bkp/Media"];
  };
};
#+end_src

**** End
:PROPERTIES:
:ID:       cf0131f7-bad4-4a4d-a622-71fefc111d82
:END:

#+BEGIN_SRC nix
};
# virtualisation.docker.enable = true;
#+END_SRC

*** Packages
:PROPERTIES:
:ID:       367b0c5b-a853-49f2-839f-e26f554a1f5c
:END:

#+BEGIN_SRC nix
environment.systemPackages = with pkgs; [
  coreutils binutils
  curl wget
  zip unzip
  git
  killall
  syncthing-cli
  sshfs
  mtr # traceroute
  sysstat
  htop
];
#+END_SRC

*** Fonts
:PROPERTIES:
:ID:       2ae32431-9f9a-447e-a27c-1fde8ed52a71
:END:

#+BEGIN_SRC nix

fonts = {
  enableFontDir = true;
  enableGhostscriptFonts = true;
  fonts = with pkgs; [
    corefonts
    hack-font
  ];
};
#+END_SRC

*** User Definition
:PROPERTIES:
:ID:       b525bfc9-8a31-4247-baf1-c1ff9125e97a
:END:

#+BEGIN_SRC nix

security.sudo.wheelNeedsPassword = false;

users.mutableUsers = false;

users.extraUsers.${config.settings.username} = {
  isNormalUser = true;
  uid = 1000;
  createHome = true;
  home = "/home/${config.settings.username}";
  description = "${config.settings.name}";
  extraGroups = [
    "audio"
    "networkmanager"
    "systemd-journal"
    "vboxusers"
    "video"
    "wheel"
  ];
};

home-manager.users.dan = import ./home.nix ;
#+END_SRC

*** SSH
:PROPERTIES:
:ID:       c427e0b1-ff8d-4cce-b01a-e1102b41c906
:END:

#+BEGIN_SRC nix

services.openssh = {
  enable = true;
  forwardX11 = true;
  permitRootLogin = "without-password";
  passwordAuthentication = false;
};

users.users.${config.settings.username}.openssh.authorizedKeys.keys = [
  "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC+yJ5sv7iO9PBuozfmitR0JJfqDsJ7w+rlryq5CwdatO3tkRdR5dMYdFTFCeHbmeakPTC/uys08fziEUXh3DL206jDKQEMBoMGXNowZHyYzr25nIogHbveqeNTgP8jsTw5uBaJu8LFzHHey4Sw9WlRrvIqguUT5jB3omZh8yDWcxTrTJlTsN2TM3HILvirfVwBkD2uNTDdd5LplbZhx6x87VCs6ZNYhBjJ4CPcO4zTQuEdyyxUHEgtMkYgrS4Jb/Kl6Tleftlh55E74SZ3XXnw3lWdH9ra8ewH265iqNr/RwysagnalslBZDLl8yJcrMsCVi4tPrZZc4vaeCsIWK4X dan@x1carbon"
];

programs.ssh.startAgent = true;
#+END_SRC

*** X2Go Client
:PROPERTIES:
:ID:       193aada6-fd41-4ec5-9d51-c7964419621f
:END:

#+BEGIN_SRC nix

  # programs.x2goserver.enable = true;
#+END_SRC

*** End
:PROPERTIES:
:ID:       3606c19d-4d09-4c08-8539-fb993b9ed3b9
:END:

#+BEGIN_SRC nix
}
#+END_SRC

** User-level Config

:PROPERTIES:
:header-args: :tangle nixos/home.nix :comments link
:END:

#+BEGIN_SRC nix
{ config, pkgs, ... }:

let
  homeDir = builtins.getEnv "HOME";
  syncDir = builtins.toPath("${homeDir}/Sync");
  sources = import ./nix/sources.nix;
  nixos20_03 = import sources."nixpkgs-20.03" { };
  emacs-overlay = import (import ./nix/sources.nix)."emacs-overlay";
in {
  imports = [
    ./settings.nix
  ];

  home.stateVersion = "20.03";

  nixpkgs.config = {
    allowUnfree = true;
    packageOverrides = pkgs: { stable = nixos20_03; };
  };

  nixpkgs.overlays = [ emacs-overlay ];

  #+END_SRC

*** Environment Variables

#+BEGIN_SRC nix
home.sessionVariables = {
  EDITOR = "emacsclient --create-frame --alternate-editor emacs";
  PASSWORD_STORE_DIR = "${syncDir}/.password-store";
  GNUPGHOME = "${syncDir}/.gnupg/";
  # GTK2_RC_FILES="${homeDir}/.gtkrc-2.0";
  # https://github.com/xmonad/xmonad/issues/126
  _JAVA_AWT_WM_NONREPARENTING = "1";
};

# gtk = {
#   enable = true;
#   iconTheme = {
#     name = "Adwaita";
#     package = pkgs.gnome3.adwaita-icon-theme;
#   };
#   theme = {
#     name = "Adwaita-dark";
#     package = pkgs.gnome3.gnome_themes_standard;
#   };
# };

xdg.enable = true;
#+END_SRC

*** Packages
#+BEGIN_SRC nix

home.packages = with pkgs; [
  rofi
  gnupg

  (pass.withExtensions (exts: [
    exts.pass-otp
    exts.pass-genphrase
  ]))

  xtrlock-pam  # screen locking
  maim  # screenshots
  rofi-pass  # interface to password manager
  xclip  # programmatic access to clipbaord
  arandr  # gui for xrandr (monitor layout)

  # direnv

  # Upstream failing :(
  # julia_13

  ## Doom dependencies

  (ripgrep.override {withPCRE2 = true;})
  gnutls              # for TLS connectivity

  ## Optional dependencies
  fd                  # faster projectile indexing
  imagemagick         # for image-dired
  pinentry_emacs

  ## Module dependencies
  # :tools lookup & :lang org +roam
  sqlite
  # :lang latex & :lang org (latex previews)
  texlive.combined.scheme-tetex

  firefox-beta-bin
];
#+END_SRC

*** Programs

#+BEGIN_SRC nix
programs = {
#+END_SRC

**** Home Manager

#+BEGIN_SRC nix
# Let Home Manager install and manage itself.
home-manager.enable = true;
#+END_SRC

**** Emacs

#+BEGIN_SRC nix
emacs = {
  enable = true;
  # Compile with imagemagick support so I can resize images.
  package = pkgs.emacsGit.override { inherit (pkgs) imagemagick; };
};
#+END_SRC

**** Bash

#+BEGIN_SRC nix
bash = {
  enable = true;
  historyFile = "${syncDir}/.config/bash/.bash_history";
  # FIXME: Document and reduce these
  shellOptions = [
    "autocd" "cdspell" "dirspell" "globstar" # bash >= 4
    "cmdhist" "nocaseglob" "histappend" "extglob"];
  # TODO: Test this
  # https://github.com/akermu/emacs-libvterm#directory-tracking-and-prompt-tracking
  initExtra = [
    ''
    vterm_prompt_end(){
      vterm_printf \"51;A$(whoami)@$(hostname):$(pwd)\"
    }
    PS1=$PS1'\\[$(vterm_prompt_end)\\]'
    ''
  ]
};
#+END_SRC

**** Git

#+BEGIN_SRC nix
git = {
  enable = true;
  userName = "${config.settings.name}";
  userEmail = "${config.settings.email}";
};
#+END_SRC

**** Direnv

#+BEGIN_SRC nix
# direnv.enable = true;
#+END_SRC

